# Pandas
ref: code with harry

In [5]:
import numpy as np
import pandas as pd

In [6]:
dict1 = {
    "name":['harsh','hani','harshit'],
    "marks":[100,58,91],
    "city":['Rampur','kolkata','dholpur']
}

In [7]:
df = pd.DataFrame(dict1)
df

      name  marks     city
0    harsh    100   Rampur
1     hani     58  kolkata
2  harshit     91  dholpur

In [8]:
df.to_csv('Learning_pandas.csv')

In [9]:
df.to_csv('Learning_pandas_IndexFalse.csv', index = False)

In [12]:
df.head(2) #first two data
df.tail(2) #last two data

    name  marks     city
0  harsh    100   Rampur
1   hani     58  kolkata

In [14]:
df.describe()

            marks
count    3.000000
mean    83.000000
std     22.113344
min     58.000000
25%     74.500000
50%     91.000000
75%     95.500000
max    100.000000

In [16]:
data = pd.read_csv('Train_data.csv')
data

   Train no  Speed     City
0     12322     34   Rampur
1     12534    123  kolkata
2    125654     67  dholpur
3    564523     87  gwalior

In [17]:
data['Speed']

0     34
1    123
2     67
3     87
Name: Speed, dtype: int64

In [18]:
data['Speed'][0]

34

In [19]:
data['Speed'][0]= 100
data

C:\Users\hanis\AppData\Local\Temp\ipykernel_13412\2189471887.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Speed'][0]= 100

   Train no  Speed     City
0     12322    100   Rampur
1     12534    123  kolkata
2    125654     67  dholpur
3    564523     87  gwalior

In [ ]:
data.to_csv('Train_data.csv')